{"data":{"markdownRemark":{"html":"<p>I call it the intermediate developer wonderland, where all the tutorials are trivial, where you are infinitely switching languages/frameworks, and never proceeding to more substantial projects of your own.</p>\n<p>It's rough, and an easy trap to fall into. The content is so good, and makes you feel like you are learning something important when you are really running in place.</p>\n<p>The key is to remove choice to avoid the resulting analysis paralysis.</p>\n<ol>\n<li>Go to <a href=\"https://www.freecodecamp.org/\">https://www.freecodecamp.org/</a></li>\n<li>Do all of the tutorials and projects in order. (You don't know enough to know when it's ok to skip things. When you know enough, you don't need the program at all.)</li>\n<li>Complete all the projects and certs along the way.</li>\n<li>You will not deviate from this curriculum except for these reasons.</li>\n<li>You have a personal project idea you are very passionate about and that you are actively working successfully towards competition.</li>\n<li>You have ingratiated yourself into an open source projects as a regular active contributor and you have people that are actively mentoring you within the project.</li>\n<li>You have gotten an internship in development with senior developers to guide your progress.</li>\n<li>You no are no longer interested in become a developer.</li>\n<li>You will go back to the program if any of these are not the case.</li>\n<li>You will only graduate from this plan when you have a full time job as a developer or you complete the full program.</li>\n</ol>\n<p>You will most likely be employed as a developer before you complete the program. You will start applying to jobs after you complete the Front End Libraries Cert.</p>\n<p>After you are gainfully employed as a developer, then you can start learning other technologies.</p>\n<p>Now us nerds may argue about alternatives to FCC. But it isn't important. What is important is that Javascript is extremely easy to learn, very high demand, and has low entry level requirements. And the FCC community is huge and active. This is why I chose it, and why other options are only muddying the waters with choice and less optimal consideration for job opportunities.  Yes, you can learn Django or Rails, and there are great free online programs for those, but there are 10 JS jobs for every one of those other stacks, and JS has true multiplaform viability and demand which gives greater long term return on investment and flexibility. JS is simply the optimal choice even considering local job market oddities. Any company that touches the web is going to need JS developers in all but the most dead market.</p>\n<p>The most import key is to pick something and run with it.</p>\n<p>Build.\nBuild.\nBuild.</p>\n<p>If you are not frequently at least uncomfortable about the thing you are trying to do, you aren't learning. You are stagnating. Comfort is the enemy, growth comes from discomfort.</p>\n<p>Write down some affirmations and put them where you will see the daily. I have often put them in my daily schedule, so that every time I get a notification for block of time I've set aside for something, I get a message reminding me of my determination and keeping me from self destructive doubts.</p>\n<p>Also I guess that's a tip itself. Make a schedule. I wasn't the schedule type. In fact, rigid schedules are very much an affront to my nature. But they work. Explicitly identify some short, medium and long team goals, and put aside time time in your schedule to work towards them every day, week and month. You'll be amazing at how effective it is making tiny little steps towards your goal. In the case of learning to program. Set aside at least an hour each weekday or several hours each weekend to working your program. You will get results. I promise.</p>\n<p>These video have also helped me stay on track if I was getting unfocused, as silly as it sounds.:</p>\n<p><a href=\"https://www.youtube.com/watch?v=5JAHAFvcr2o\">https://www.youtube.com/watch?v=5JAHAFvcr2o</a></p>\n<p><a href=\"https://www.youtube.com/watch?v=GrhSLf0I-HM\">https://www.youtube.com/watch?v=GrhSLf0I-HM</a></p>\n<p>Good Luck :)</p>","frontmatter":{"title":"The Beginner Developer Wonderland!","date":"2019-01-26T00:00:00.000Z"}}},"pageContext":{"slug":"/beginner-developer-wonderland/"}}